app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(date_due: :asc)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."date_due" DESC

  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    this_task = Task.new(task_params)
    is_successful = this_task.save
---
INSERT INTO "tasks" ("task_name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["task_name", "Take a break!"], ["description", "Play your cello, stretch, learn that wheel thing."], ["created_at", "2019-04-13 17:55:15.135725"], ["updated_at", "2019-04-13 17:55:15.135725"]]

  def update
    this_task = Task.find_by(id: params[:id])

    is_successful = this_task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Make some tea, play your cello, stretch, learn that wheel thing."], ["updated_at", "2019-04-13 21:10:57.251474"], ["id", 8]]

  def destroy
    this_task = Task.find_by(id: params[:id])

    is_successful = this_task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 9]]

  def toggle_completed
    this_task = Task.find_by(id: params[:id])
    # raise
    # this_task.toggle(:completed)
    # this_task[:date_completed] = Time.now
    # this_task.save

    if this_task.completed == true
      this_task.completed = false
      this_task[:date_completed] = nil
    elsif this_task.completed == false
      this_task.completed = true
      this_task[:date_completed] = Time.now
    end

    this_task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "date_completed" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completed", false], ["date_completed", nil], ["updated_at", "2019-04-15 02:17:29.706333"], ["id", 15]]